tap "homebrew/services"
brew "adr-tools"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "libyaml"
brew "python@3.12"
brew "azure-cli"
brew "glib"
brew "pycparser"
brew "cffi"
brew "curl"
brew "dua-cli"
brew "fd"
brew "harfbuzz"
brew "openjpeg"
brew "pango"
brew "ffmpeg"
brew "gcc"
brew "pmix"
brew "open-mpi"
brew "fzf"
brew "gdk-pixbuf"
brew "ghostscript"
brew "gnupg"
brew "go-task"
brew "gpgme"
brew "hdf5"
brew "helix"
brew "htop"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "libmatio"
brew "librsvg"
brew "luajit"
brew "neovim"
brew "node"
brew "openslide"
brew "poetry"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "pyenv"
brew "python@3.11"
brew "ripgrep"
brew "stow"
brew "terraform"
brew "tmux"
brew "tree"
brew "uv"
brew "vips"
brew "virtualenv"
brew "wget"
brew "yazi"
brew "yq"
cask "alacritty"
cask "gcloud-cli"
cask "hyper"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anthropic.claude-code"
vscode "anysphere.pyright"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
vscode "leonardssh.vscord"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "withfig.fig"
