brew "awscli"
brew "bazelisk"
brew "colima"
brew "coreutils"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "dua-cli"
brew "duckdb"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "git"
brew "go-task"
brew "helix"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "pandoc"
brew "poppler"
brew "postgresql@14"
brew "resvg"
brew "ripgrep"
brew "ruff"
brew "sevenzip"
brew "stow"
brew "tmux"
brew "tree"
brew "uv"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "gh"

cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "gitkraken-cli"
cask "gpg-suite"
cask "snowflake-snowsql"

vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "astral-sh.ty"
vscode "catppuccin.catppuccin-vsc"
vscode "illixion.vscode-vibrancy-continued"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "qufiwefefwoyn.kanagawa"
vscode "samuelcolvin.jinjahtml"
vscode "waderyan.gitblame"
